prisma/dbml/schema.dbml
//// ------------------------------------------------------
//// THIS FILE WAS AUTOMATICALLY GENERATED (DO NOT MODIFY)
//// ------------------------------------------------------

Table Consumer {
  id String [pk]
  firstName String
  lastName String
  email String [unique]
  displayEmail String
  handle String [unique]
  referralCode String [unique, not null]
  phone String [unique]
  locale String
  dateOfBirth String
  isLocked Boolean [not null, default: false]
  isDisabled Boolean [not null, default: false]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
  socialSecurityNumber String
  referredByID String
  referredBy Consumer
  referredConsumers Consumer [not null]
  address Address
  verificationData KYC
  cryptoWallets CryptoWallet [not null]
  paymentMethods PaymentMethod [not null]
  circleAccountData Circle
  debitTransactions Transaction [not null]
  creditTransactions Transaction [not null]
  Employee Employee [not null]
}

Table Address {
  id String [pk]
  streetLine1 String
  streetLine2 String
  city String
  countryCode String [not null]
  regionCode String
  postalCode String
  consumer Consumer [not null]
  consumerID String [unique, not null]
}

Table KYC {
  id String [pk]
  kycCheckReference String
  documentCheckReference String
  provider KYCProvider [not null, default: 'SARDINE']
  riskRating String
  isSuspectedFraud Boolean [not null, default: false]
  kycCheckStatus KYCStatus [not null, default: 'NOT_SUBMITTED']
  documentVerificationStatus DocumentVerificationStatus [not null, default: 'REQUIRED']
  documentVerificationTimestamp DateTime
  kycVerificationTimestamp DateTime
  sanctionLevel String
  riskLevel String
  consumer Consumer [not null]
  consumerID String [unique, not null]
}

Table Employer {
  id String [pk]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
  name String [not null]
  logoURI String [not null]
  referralID String [unique, not null]
  bubbleID String [unique, not null]
  leadDays Int [not null]
  paymentSchedules Int[] [not null]
  Employee Employee [not null]
}

Table Employee {
  id String [pk]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
  allocationAmount Float [not null]
  allocationCurrency String [not null]
  employer Employer [not null]
  employerID String [not null]
  consumer Consumer [not null]
  consumerID String [not null]

  indexes {
    (consumerID, employerID) [unique]
  }
}

Table CryptoWallet {
  id String [pk]
  address String [unique, not null]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
  name String
  chainType String
  isEVMCompatible Boolean
  status WalletStatus [not null, default: 'PENDING']
  riskScore Float
  consumer Consumer [not null]
  consumerID String [not null]
}

Table PaymentMethod {
  id String [pk]
  name String
  type PaymentMethodType [not null]
  paymentToken String [unique, not null]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
  paymentProvider PaymentProvider [not null]
  status PaymentMethodStatus [not null]
  isDefault Boolean [not null, default: false]
  imageUri String
  consumer Consumer [not null]
  consumerID String [not null]
  cardData Card
  achData ACH
}

Table Card {
  id String [pk]
  cardType String
  scheme String
  first6Digits String [not null]
  last4Digits String [not null]
  authCode String
  authReason String
  paymentMethod PaymentMethod [not null]
  paymentMethodID String [unique, not null]
}

Table ACH {
  id String [pk]
  accountID String [not null]
  accessToken String [not null]
  itemID String [not null]
  mask String [not null]
  accountType String [not null]
  paymentMethod PaymentMethod [not null]
  paymentMethodID String [unique, not null]
}

Table Circle {
  id String [pk]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
  walletID String [unique, not null]
  consumer Consumer [not null]
  consumerID String [unique, not null]
}

Table Otp {
  id String [pk]
  otpIdentifier String [not null]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
  otp Int [not null]
  otpExpirationTimestamp DateTime [not null]
  identityType IdentityType [not null]

  indexes {
    (otpIdentifier, identityType) [unique]
  }
}

Table LimitProfile {
  id String [pk]
  name String [not null]
  daily Float
  weekly Float
  monthly Float [not null]
  maxTransaction Float [not null]
  minTransaction Float [not null]
  unsettledExposure Float
  LimitConfiguration LimitConfiguration [not null]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
}

Table LimitConfiguration {
  id String [pk]
  isDefault Boolean [not null, default: false]
  priority Int [not null]
  profile LimitProfile [not null]
  profileID String [not null]
  transactionType TransactionType
  minProfileAge Int
  minBalanceInWallet Float
  minTotalTransactionAmount Float
  paymentMethodType PaymentMethodType
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
}

Table Transaction {
  id String [pk]
  transactionRef String [unique, not null]
  workflowName String [not null]
  debitConsumer Consumer
  debitConsumerID String
  creditConsumer Consumer
  creditConsumerID String
  status String [not null, default: 'INITIATED']
  memo String
  sessionKey String [not null]
  debitCurrency String
  creditCurrency String
  debitAmount Float
  creditAmount Float
  exchangeRate Float
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
  transactionEvents TransactionEvent [not null]
  Mono Mono
}

Table TransactionEvent {
  id String [pk]
  timestamp DateTime [default: `now()`]
  transaction Transaction [not null]
  transactionID String [not null]
  internal Boolean [not null, default: true]
  message String [not null]
  details String
  key String
  param1 String
  param2 String
  param3 String
  param4 String
  param5 String
}

Table Mono {
  id String [pk]
  monoTransactionID String
  collectionLinkID String [unique, not null]
  collectionURL String [not null]
  state String [not null]
  nobaTransactionID String [unique, not null]
  transaction Transaction [not null]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
}

Table Token {
  id String [pk]
  tokenType TokenType [not null]
  expiryTime DateTime
  userID String [not null]
  isUsed Boolean [not null, default: false]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
}

Table Admin {
  id String [pk]
  name String
  email String [unique, not null]
  role String [not null]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
}

Table Verification {
  id String [pk]
  userID String
  transactionID String [unique]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
}

Table CreditCardBIN {
  id String [pk]
  issuer String
  bin String [unique, not null]
  type String [not null]
  network String [not null]
  mask String
  supported String [not null]
  digits Int [not null]
  cvvDigits Int [not null]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
}

Table ExchangeRate {
  id String [pk]
  createdTimestamp DateTime [default: `now()`]
  updatedTimestamp DateTime
  numeratorCurrency String [not null]
  denominatorCurrency String [not null]
  bankRate Float [not null]
  nobaRate Float [not null]
  expirationTimestamp DateTime [not null]
}

Enum IdentityType {
  CONSUMER
  NOBA_ADMIN
}

Enum KYCStatus {
  NOT_SUBMITTED
  PENDING
  APPROVED
  FLAGGED
  REJECTED
}

Enum DocumentVerificationStatus {
  NOT_REQUIRED
  REQUIRED
  PENDING
  APPROVED
  REJECTED
  REJECTED_DOCUMENT_REQUIRES_RECAPTURE
  REJECTED_DOCUMENT_POOR_QUALITY
  REJECTED_DOCUMENT_INVALID_SIZE_OR_TYPE
  LIVE_PHOTO_VERIFIED
}

Enum WalletStatus {
  PENDING
  FLAGGED
  REJECTED
  APPROVED
  DELETED
}

Enum PaymentMethodType {
  CARD
  ACH
}

Enum PaymentProvider {
  CHECKOUT
}

Enum PaymentMethodStatus {
  FLAGGED
  REJECTED
  APPROVED
  UNSUPPORTED
  DELETED
}

Enum KYCProvider {
  SARDINE
}

Enum TransactionType {
  NOBA_WALLET
}

Enum TokenType {
  REFRESH_TOKEN
}

Ref: Consumer.referredByID - Consumer.id

Ref: Address.consumerID - Consumer.id [delete: Cascade]

Ref: KYC.consumerID - Consumer.id [delete: Cascade]

Ref: Employee.employerID > Employer.id [delete: Cascade]

Ref: Employee.consumerID > Consumer.id [delete: Cascade]

Ref: CryptoWallet.consumerID > Consumer.id [delete: Cascade]

Ref: PaymentMethod.consumerID > Consumer.id [delete: Cascade]

Ref: Card.paymentMethodID - PaymentMethod.id [delete: Cascade]

Ref: ACH.paymentMethodID - PaymentMethod.id [delete: Cascade]

Ref: Circle.consumerID - Consumer.id [delete: Cascade]

Ref: LimitConfiguration.profileID > LimitProfile.id [delete: Cascade]

Ref: Transaction.debitConsumerID > Consumer.id [delete: Cascade]

Ref: Transaction.creditConsumerID > Consumer.id [delete: Cascade]

Ref: TransactionEvent.transactionID > Transaction.id [delete: Cascade]

Ref: Mono.nobaTransactionID - Transaction.id [delete: Cascade]
